---
kind: property
id: P:Autodesk.Revit.DB.EvaluatedParameter.Definition
source: html/d2184f58-82a5-472f-4cae-64cbaeeb36c9.htm
---
# Autodesk.Revit.DB.EvaluatedParameter.Definition Property

Definition of the parameter.

## Syntax (C#)
```csharp
public InternalDefinition Definition { get; }
```